# RevitLinkOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkOptions Class
Members See Also
---
This class contains the options in use when creating or loading a Revit link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RevitLinkOptions : IDisposable
```

Visual Basic
---
```text
Public Class RevitLinkOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RevitLinkOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RevitLinkOptions
# See Also
RevitLinkOptions Members
Autodesk.Revit.DB Namespace